---
kind: type
id: T:Autodesk.Revit.DB.FaceWall
source: html/cd76c5c4-4c8d-8101-5ebb-fa1ba4dcf9a1.htm
---
# Autodesk.Revit.DB.FaceWall

A wall attached to a non-vertical massing face.

## Syntax (C#)
```csharp
public class FaceWall : HostObject
```